app/controllers/api/feeds_controller.rb

INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://rss.nytimes.com/services/xml/rss/nyt/HomePage.xml' LIMIT 1
---
  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])